In [1]:
import numpy as np
import pandas as pd

In [3]:
ser = pd.Series(np.random.randn(6), index = [[1,1,1,2,2,2],['a', 'b', 'c', 'a', 'b', 'c']])
ser

1  a    0.092696
   b   -0.568569
   c   -0.540010
2  a    1.707193
   b   -0.731572
   c    1.350357
dtype: float64

In [4]:
ser.index

MultiIndex([(1, 'a'),
            (1, 'b'),
            (1, 'c'),
            (2, 'a'),
            (2, 'b'),
            (2, 'c')],
           )

In [5]:
ser[1]

a    0.092696
b   -0.568569
c   -0.540010
dtype: float64

In [6]:
ser[2]

a    1.707193
b   -0.731572
c    1.350357
dtype: float64

In [7]:
ser[a]

NameError: name 'a' is not defined

In [8]:
ser

1  a    0.092696
   b   -0.568569
   c   -0.540010
2  a    1.707193
   b   -0.731572
   c    1.350357
dtype: float64

In [9]:
# want to know 1-a, 2-a

ser[:, 'a']

1    0.092696
2    1.707193
dtype: float64

In [10]:
dframe = ser.unstack()
dframe

          a         b         c
1  0.092696 -0.568569 -0.540010
2  1.707193 -0.731572  1.350357

In [14]:
dframe2 = pd.DataFrame(np.arange(16).reshape((4,4)), index = [['a', 'a', 'b', 'b'], [1,2,1,2]], 
                                            columns = [['NY', 'NY', 'LA', 'SF'],['cold', 'hot', 'hot', 'cold']])

dframe2

      NY      LA   SF
    cold hot hot cold
a 1    0   1   2    3
  2    4   5   6    7
b 1    8   9  10   11
  2   12  13  14   15

In [16]:
dframe2.index.names = ['INDEX_1', 'INDEX_2']
dframe2.columns.names = ['Cities', 'Temp']

dframe2

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [21]:
dframe2.swaplevel('Cities', 'Temp', axis = 1)
# axis = 1 : col

Temp            cold hot     cold
Cities            NY  NY  LA   SF
INDEX_1 INDEX_2
a       1          0   1   2    3
        2          4   5   6    7
b       1          8   9  10   11
        2         12  13  14   15

In [24]:
dframe2.swaplevel(0)

Cities            NY      LA   SF
Temp            cold hot hot cold
INDEX_2 INDEX_1
1       a          0   1   2    3
2       a          4   5   6    7
1       b          8   9  10   11
2       b         12  13  14   15

In [25]:
dframe2.sum(level = 'Temp', axis = 1)
# sum of specific level

Temp             cold  hot
INDEX_1 INDEX_2
a       1           3    3
        2          11   11
b       1          19   19
        2          27   27